---
kind: method
id: M:Autodesk.Revit.DB.Analysis.GenericZoneDomainData.Dispose
source: html/136b0614-6046-d1cb-3001-0940281dc129.htm
---
# Autodesk.Revit.DB.Analysis.GenericZoneDomainData.Dispose Method

Releases all resources used by the GenericZoneDomainData

## Syntax (C#)
```csharp
public void Dispose()
```